;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or
;; use 'M-x doom/reload'.

(package! evil-snipe :disable t)

(package! jinja2-mode)

(package! avy)
(package! buffer-move)
(package! expand-region)
(package! iedit)
(package! org-ref)
(package! smex)
